repository/UsersRepository.php

SELECT * FROM "users" WHERE "id"=40
---
    public static function getUserById($id){
        return Users::find()->where(["id"=>$id])->one();

INSERT INTO "users" ("email", "name", "password", "age", "is_admin") VALUES ('b@b.b', 'b', '$2y$10$.aEpGI5BvMSSGxhOcfddtuCDznPN6BaKeW1EEZq4h2ttw8R8QG24G', 12, FALSE) RETURNING "id"
---
    public static function createUser($email, $password, $name, $age, $is_admin = false)
    {
        $user = new Users();
        $user->email = $email;
        $user->name = $name;
        $user->password = password_hash($password, PASSWORD_DEFAULT);
        $user->age = $age;
        $user->is_admin = $is_admin;

        $user->save();

SELECT * FROM "users" WHERE "email"='b@b.b'
---
    public static function getUserByEmail($email){
        return Users::find()->where(["email"=> $email])->one();